### development Part # 3
  #### Terraform Format and Style 🖌`skipped`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  pv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.20.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags_all                                       = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.vpc will be created%0A  + resource "aws_vpc" "vpc" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.20.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags_all                             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A    }%0A%0APlan: 31 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0

  ```
  </details>
  *Pusher: @cashewhands, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*